#Region Variables
var МояПеременная;
#EndRegion
Перем ВтораяПеременная;

#Область ПерваяОбласть
    Процедура ПервыйМетод()
        А = 0;
    КонецПроцедуры
#КонецОбласти

&НаСервере
Функция ПередОбластью()

КонецФункции

#Область ВтораяОбласть

    Процедура ВторойМетод()
        А = 0;
#КонецОбласти
    КонецПроцедуры

Процедура ПроцедураВнеОбласти()
А = Б;
КонецПроцедуры

&НаКлиенте
Функция ФункцияВнеОбласти()
КонецФункции

#region ВнешняяОбласть
#region ВнутренняяОбласть
Функция ВнутреннийМетод()
КонецФункции
#EndRegion
#endRegion

А = Б;

#Область Инициализация
    А = Б;
#КонецОбласти